# 参数配置
# ===============================
# 趋势提取参数配置
# ===============================

TREND_CONFIG = {

    # 🔹 前半段：稳态趋势（抗噪）
    "front": {
        "window_size": 15,
        "step": 3,
        "area_ratio": 0.6,
        "neutral_amp_ratio": 0.15,
        "min_len": 5,
    },

    # 🔹 后半段：敏感趋势（不合并）
    "back": {
        "window_size": 9,
        "step": 2,
        "area_ratio": 0.5,
        "neutral_amp_ratio": 0.10,
        "min_len": 1,   # 🚨 不合并
    },

    # 🔹 分段位置
    "split_ratio": 0.5
}
